#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-9us7VejJHBtNpGv1

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 1s [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.prometheus-stack: Refreshing state... [id=prometheus-stack]
kubernetes_namespace.gateway: Refreshing state... [id=gateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.flagger will be created
  + resource "helm_release" "flagger" {
      + atomic                     = false
      + chart                      = "flagger"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "flagger"
      + namespace                  = "istio-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://flagger.app"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "meshProvider"
          + value = "istio"
        }
      + set {
          + name  = "metricsServer"
          + value = "http://prometheus-stack-kube-prom-prometheus.prometheus-stack:9090/"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*